Revit 2027 API
TemporaryViewModes.DeactivateAllModes Method
 Deactivates all temporary modes that are currently active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeactivateAllModes()
Public Sub DeactivateAllModes
public:
void DeactivateAllModes()
member DeactivateAllModes : unit -> unit
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace